from random import choice


def average_student_hw():
    hw = [
        ", виконує домашні завдання добре, але раджу трішки більше приділяти їм уваги та більш ретельно пропрацьовувати. ",
        ", домашні завдання в більшості виконані, але раджу більше їх пропрацьовувати. ",
        ", домашні завдання є, і в свої більшості виконані, але трішки більше їм уваги. ",
        ", ви продемонстрували середній рівень знань при виконанні домашніх завдань, і я впевнений, що з додатковими зусиллями та відданістю ви зможете покращити свої досягнення.",
    ]

    return f"{choice(hw)}"


def average_student_cw():
    cw = ["Добре засвоює новий матеріал, але раджу трішки більше активності!",
          "На високий бал виконує практичні задання, але на парах не завжди досить активно працює.",
          "Прошу продовжувати брати участь у класних обговореннях та ставити питання, які вас цікавлять.",
          "Ви не погано працюєте під час занять, але трішки не достатньо! Не соромтеся звертатися за додатковою допомогою чи поясненням, я завжди допоможу вам розібратися в складних темах. Вірю в ваш потенціал та впевнений, що з наполегливістю і зосередженістю ви зможете досягти більших успіхів у вивченні предмета. ",
          ]
    return f"{choice(cw)}"


def strong_student():
    d = [
        ", виконує домашні завдання на високому рівні, це допомагає максимально засвоювати навчальний матеріал та досягати успіху у навчанні. ",
        ", завжди активно працює на заняттях, бере участь у обговоренні нового матеріалу, відповідає на питання. Показує відмінні результати при виконанні практичних та домашній робіт. Молодець!",
        ", показує високу робочу дисципліну на зустрічах та завжди виконує домашні і практичні завдання.",
        ", із завзяттям підходить до виконання всіх поставлених завдань. Ставить правильні питання, бере участь у обговоренні нового матеріалу. Молодець!",
        ", швидко засвоює новий матеріал, цікавиться темою додатково. Молодець! Всі домашні та практичні роботи викнонуються вчасно та на високому рівні. Бажаю успіхів у подальшому навчанні!",
        ", відповідає на питання, виконує всі поставлені задачі вчасно та на високому рівні. Має відмінну дисципліну на заняттях, бере участь у обговоренні нового матеріалу та швидко його засвоює. Бажаю успіхів у подальшому навчанні!",
        ", завжди уважно працює під час пар, вчасно і якісно виконує домашні завдання. Молодець!",
        ", всі практичні та домашні роботи виконує вчасно та на високому рівні. Так тримати!",
        ", зусилля та відданість вражають. Ви проявляєте зацікавленість, і активно берете участь у класних обговореннях. Ваше віддане ставлення до навчання надихає не лише вас, але й ваших колег. Продовжуйте розвивати свою цікавість предмета. Я впевнений, що ваші знання та інтерес до предмета принесуть вам неймовірні досягнення в майбутньому.",
    ]
    return f"{choice(d)}"


def weak_student_hw():
    hw = [", не всі домашні завдання виконані, та не до кінця пропрацьовані. ",
          ", нажаль, домашні  робить с запізненням та не до кінця пропрацьовані.",
          ", зверніть, будь ласка, увагу на домашні завдання. Вже досить відчутна заборгованість",
          ", наразі ви маєте низький рівень знань у цій галузі, але важливо пам'ятати, що кожна людина вчиться у своєму власному темпі. Прошу вас не втрачати віру у себе та продовжувати працювати над вдосконаленням знань. Можливо, вам буде корисно звертатися за додатковою допомогою чи консультаціями щодо тих аспектів, які ви вважаєте найскладнішими.",
          ]
    return f"{choice(hw)}"


def weak_student_cw():
    cw = ["На зяняття потрібно працювати більш активніше та виконувати практичні роботи",
          "Раджу активніше працювати на заняттях! Пам'ятайте, що кожна помилка – це можливість вчитися та рости. Я вірю, що з часом і зусиллями ви досягнете бажаних результатів.",
          ]
    return f"{choice(cw)}"


def strong_cw():
    cw = ["На заняттях працює дуже добре!",
          "Показує високу робочу дисципліну на зустрічах та завжди виконує практичні завдання.", ]
    return f"{choice(cw)}"


def cw_zero():
    cw = ["Нажаль, на заннятях працює не активно.",
          "Раджу більш активно працювати на заннятях.",
          "Хотілось би більшої активності на зайняттях"]
    return f"{choice(cw)}"
